# Напишите программу, которая приветствует пользователя, выводя слово Hello, введенное имя и
# знаки препинания по образцу: “Hello, your_name!”.

name = input('Enter your name: ')

print(F'Hello, {name}!')