#Напишите программу, которая будет выводить ваше имя и фамилию.

#Способ 1
name = "Вячеслав"
surname = "Находнов"
print(name, surname)

#Способ 2
name = input('Введите имя: ')
surname = input('Введите фамилию: ')
print(name, surname)